metarosetta.el

(cl-defmethod mrosetta-parse ((mlexpression mrosetta-mlexpression) &optional sub-definition)
  "Parse the metalanguage-specified definition within the MLEXPRESSION instance. Optionally, parse the explicitly-set SUB-DEFINITION instead."
  (let ((mldefinition (if (eq sub-definition nil)
                          (copy-tree (slot-value mlexpression 'mldefinition))
                        (copy-tree sub-definition)))
        (larg nil)
        (element nil)
        (rarg nil))
    (while (> (length mldefinition) 0)
      (setq element (pop mldefinition)
            rarg (car mldefinition))
      (when (symbolp element)
        ;; The element is a metalanguage keyword, so lookup the corresponding function and parse accordingly
        (let ((leftout-args (funcall (cdr (assq element mrosetta-mlsyntax)) mlexpression :left larg :right rarg)))
          (setq larg nil)
          (when (eq (plist-get leftout-args :right) nil)
            (pop mldefinition))))
      (when (and (listp element) (> (length element) 0))
        ;; The element is a nested fractal expression
        (setf (slot-value mlexpression 'extype) :fractal)
        (let ((fractal-mlexpression (mrosetta-mlexpression :mldefinition element :rkeychain (slot-value mlexpression 'rkeychain))))
          (setf (slot-value mlexpression 'fractals) `(,@(slot-value mlexpression 'fractals) ,fractal-mlexpression))
          (mrosetta-parse fractal-mlexpression))
        (setq larg nil))
      (when (stringp element)
        ;; The element is a quoted string, so just pass it along
        (setq larg element)))))

(cl-defmethod mrosetta-compile ((mlexpression mrosetta-mlexpression))
  "Compile the MLEXPRESSION instance into a regular expression structure."
  (let* ((rkeychain (slot-value mlexpression 'rkeychain))
         (regex)
         (regex-key (mrosetta-generate-regex-key rkeychain))
         (rinstance)
         (rinstance-key (mrosetta-generate-regex-key rkeychain))
         (rmatch (slot-value mlexpression 'rmatch))
         (rmatch-key (mrosetta-generate-regex-key rkeychain))
         (rprefix (slot-value mlexpression 'rprefix))
         (rsuffix (slot-value mlexpression 'rsuffix))
         (is-optional (slot-value mlexpression 'is-optional))
         (is-plural (slot-value mlexpression 'is-plural)))
    (if (eq (slot-value mlexpression 'extype) :fractal)
        ;; Fractal Expressions cannot have end-matches
        (when rmatch
          (error "Metalanguage syntax error: End-matching expressions, like words or paragraphs, must be defined with parentheses"))
        ;; Recursively compile all nested fractal expression instances
        (let ((fractals (slot-value mlexpression 'fractals)))
          (dolist (fractal fractals)
            (setq rmatch (concat rmatch "[[:blank:]]+" (mrosetta-compile fractal)))))
      ;; Literal or end Match
      (when (eq rmatch nil)
        (setq rmatch (slot-value mlexpression 'rbase))))
    ;; Compile the total match, instance and expression-encompassing regular expressions
    (setq rmatch (concat "\(?" rmatch-key ":" rmatch "\)"))
    (setq rinstance (concat "\(?" rinstance-key ":" rprefix rmatch rsuffix "\)"))
    (setq regex (concat "\(?" regex-key ":"
                        rinstance
                        (when is-plural "+")
                        "\)"
                        (when is-optional "?")))
    (setf (slot-value mlexpression 'rmatch-key) rmatch-key
          (slot-value mlexpression 'rmatch) rmatch
          (slot-value mlexpression 'rinstance-key) rinstance-key
          (slot-value mlexpression 'rinstance) rinstance
          (slot-value mlexpression 'regex-key) regex-key
          (slot-value mlexpression 'regex) regex)))

(cl-defmethod mrosetta-process ((mlexpression mrosetta-mlexpression) htext)
  "Process human-readable text within the HTEXT string and return the semantic data structure as defined by the MLEXPRESSION instance."
  (let ((sdata '()))
    (save-match-data
      (and (string-match (mrosetta-regex mlexpression) htext)
           ;; Found match for the entirety of the expression
           (let ((mtext (match-string (mrosetta-regex-key mlexpression) htext))
                 (pos))
             (save-match-data
               ;; Iterate over all instance occurrences within the matching expression text
               (while (string-match (mrosetta-rinstance mlexpression) mtext pos)
                 (setq pos (match-end 0))
                 ;; Process the exact match as defined by the expression
                 (let ((instance-sdata)
                       (match (match-string (mrosetta-rmatch-key mlexpression) mtext)))
                   ;; Cases where the expression is a :fractal
                   (when (eq (mrosetta-extype mlexpression) :fractal)
                     ;; Recursively process all fractals within
                     (let ((fractals (mrosetta-fractals mlexpression)))
                       (dolist (fractal fractals)
                         (let ((fractal-sdata (mrosetta-process fractal (match-string (mrosetta-regex-key fractal) mtext))))
                           (when fractal-sdata
                             (setq instance-sdata `(,@instance-sdata ,fractal-sdata)))))))
                   ;; Cases where the expression is a :match
                   (when (and (eq (mrosetta-extype mlexpression) :match)
                              (not (mrosetta-is-contextual mlexpression)))
                     ;; Just store the semantic end-match
                     (setq instance-sdata match))
                   (setq sdata `(,@sdata ,instance-sdata))))))))
    (when (> (length sdata) 0)
      ;; Splice instance data in case of a singular expression
      (when (not (mrosetta-is-plural mlexpression))
        (setq sdata (car sdata)))
      ;; Return the structured semantic data object
      `(,(or (mrosetta-key mlexpression) :nokey) . ,sdata))))

(provide 'metarosetta)

;;; metarosetta.el ends here
